// 1 Задача

// let num = prompt("Сан жазыныз");
// if (num == 10) {
//   console.log("Туура");
// } else {
//   console.log("Туура эмес");
// }

// 2 Задача

// let pod = prompt("Введите номер квартиры");
// if (pod > 0 && pod < 21) {
//   console.log("Первый подъезд");
// } else if (pod > 20 && pod < 49) {
//   console.log("Второй подъезд");
// } else if (pod > 48 && pod < 91) {
//   console.log("Третий подъезд");
// } else {
//   console.log("Пашол вон");
// }

// 3 Задача

// let num = 7;
// if (num > 0 && num < 5) {
//   console.log("Туура");
// } else {
//   console.log("Туура эмес");
// }

// 4 Задача

// let clock = prompt("Введите время");
// if (clock > 5 && clock < 13) {
//   alert("С добрым утром!");
// } else if (clock > 12 && clock < 18) {
//   alert("Добрый день!");
// } else {alert
//   ("Добрый вечер!");
// }

// 5 Задача

// let clock = prompt("Убакытты жазыныз");
// if (clock > 5 && clock < 13) {
//   alert("Кутмандуу таныныз менен Samira!");
// } else if (clock > 12 && clock < 18) {
//   alert("Кутмандуу кунунуз менен Samira!");
// } else {
//   alert("Кутмандуу кечиниз менен Samira!");
// }

// 6 Задача

// let sale = prompt("Введите возраст");
// if (sale <= 6 || sale >= 65) {
//   console.log("Со скидкой");
// } else {
//   console.log("Без скидки");
// }

// 7 Задача

// let user1 = prompt("Игрок1: - Выберите: камень, ножницы, бумага");
// let user2 = prompt("Игрок2: - Выберите: камень, ножницы, бумага");
// if (
//   (user1 === "камень" && user2 === "ножницы") ||
//   (user1 === "ножницы" && user2 === "бумага") ||
//   (user1 === "бумага" && user2 === "камень")
// ) {
//   console.log("Выиграл 1 игрок");
// } else if (
//   (user2 === "камень" && user1 === "ножницы") ||
//   (user2 === "ножницы" && user1 === "бумага") ||
//   (user2 === "бумага" && user1 === "камень")
// ) {
//   console.log("Выиграл 2 игрок");
// } else if (
//   (user1 === "камень" && user2 === "камень") ||
//   (user1 === "ножницы" && user2 === "ножницы") ||
//   (user1 === "бумага" && user2 === "бумага")
// ) {
//   console.log("Ничья");
// } else {
//   console.log("Введено неправильное значение");
// }

// 8 Задача

// const number = 4;
// if (number % 2 === 0) {
//   console.log("Число чётное");
// //  Если задать в переменную number число которое делится на 2 без остатка, то на консоле выводится "число четное"
// } else {
//   console.log("Число нечётное");
//   //  Если задать в переменную number число которое не делится на 2 без остатка, то на консоле выводится "число нечетное"
// }

// 9 Задача

// let num = 6;
// console.log(num === 6 ? "six" : "not six");
